import pandas as pd
import re

def get_symbols():
    
    df = pd.read_csv("resources/symbols_info.csv", index_col=0)
    df["Corp"] = df["Corp. Title"].apply(
        lambda word: re.sub(r"\(.*\)|(ح\.)|(ح\s\.)", "", word).strip()
    )
    df = df[["Symbol", "Corp"]]
    mask = df["Corp"] == df["Symbol"]
    df["Corp"][mask] = "شرکت " + df["Corp"]
    df.head(n=10)
    
    return df

def get_events():
    events = [
        "سود",
        "زیان",
        "ضرر",
        "مثبت",
        "منفی",
        "صعود",
        "نزول",
        "افزایش",
        "کاهش",
        "رشد",
        "ریزش",
        "سقوط",

        "سبز",
        "قرمز",
        "سبزپوش",
        "قرمزپوش",   

        "افت",
        "نوسان",
        "نوسانات",
        'اسپایک',
        'رکود',
        'رکودی',    
        'نوسانی',
        'سکون',
        'ساکن',
        'ثابت', 
        'ثبات',
        'تثبیت',


        'ورود',
        'وارد',
        'خارج',
        'خروج',
        'تزریق',

        "تقسیم سود",
        "تعیین نرخ",
        "صف خرید",
        "صف فروش",
        "خروج سرمایه",
        "افزایش سرمایه",
        "خروج پول",
        "مجمع عمومی",
        "اصلاح",


        'خرید',
        'فروش',
        'اشباع خرید',
        'اشباع فروش',

        'عرضه خصوصی',
        'عرضه عمومی',
        'مبادله',
        'معادله',
        'خریداری',
        'افشا',
        'افشای الف',
        'افشا الف',
        'افشای ب',
        'افشا ب',
        'افشای فوری',
        'افشا فوری',

        'توقف',
        'توقف نماد',
        'توقف معاملات',

        'سفارش',
        'مبادلات',
        'معادلات',
        'آغاز معاملات',
        'پایان معاملات',
        'معاملات خوشه ای',
        'معاملات اشخاص خارجی',
        'معاملات اعتباری',
        'معاملات با اقربا',
        'معاملات تجدید ساختار',
        'معاملات چرخشی',
        'معاملات دوطرفه',
        'معاملات عمده',
        'معاملات مشروط',
        'معامله بلوک',
        'معامله ترجیحی',
        'پیش گشایش',
        'ادغام',
        'تملیک',
        'افزایش سرمایه',
        'افزایش سرمایه از محل',
        'پیام ناظر',
        'تجدید ارزیابی',
        'تامین مالی',
        'حراج',
        'حراج پیوسته',
        'حراج ناپیوسته',
        'سفارش دوبخشی',
        'سفارش دو بخشی',
        'سفارش روز',
        'سفارش معتبر تا لغو',
        'سفارش معتبر تا تاریخ',
        'عرضه',
        'عرضه اولیه',
        'تعلیق پذیرش',
        'تعلیق'
        'تعلیق نماد',

    ]
        
    return events

def get_announcements():
    announcements = [
        "اطلاعیه",
        "گزارش",
        "اعلامیه",
        "اعلانیه",
        'صدور',
        'انتشار',
        'خبر',
        'آگهی',
    ]
    return announcements

def get_analyses():
    analyse = [
        "سهم رانتی",
        "تحلیل تکنیکال",
        "تحلیل فاندامنتال",
        "کندل استیک",
        "سیگنال",
        "تکنیکال",
        "کندل",
        "تیک",
        "سرشانه",
        "مقاومت",
        "حمایت",
        "کراس",
        "واگرایی",
        'ورشکستگی',
        'وارونگی',
        "اندیکاتور",
        "سقف",
        "کف",
        "قیبوناچی",
        "فیبوناتچی",
        "فیبو",
        "کانال",
        "کف‌‌سازی",
        "کف سازی",
        "رنج",
        'الگو',
        'الگوی', # olgooye parvane, chakosh, ...
        'پامپ',
        'دامپ',
        'پامپ و دامپ',
        'اربیتراژ',
        'آربیتراژ',
        "پولبک",
        "پول بک",
        'شکست',
        'شکستن',
        'میدلاین',
        'تارگت',
        'هدف',
        'ترند',
        "خط حمایت",
        "خط مقاومت",
        "خط گردن",
        "خط میانی",
        "الگوی پرچم",
        "الگوی مثلث",
        "الگوی سر",
       "الگوی هارمونیک",
        "الگوی کاپ",
        "بالای ابر",
        "داخل ابر",
        "ابر کومو",
        "ابر کمو",
        "ابر ایچیموکو",
        "ابر خارج",
        "ابر ایچی",
        "خط میانگین",
        "حجم میانگین",
        "میانگین حجم",
        "چارت لگاریتمی",
        "مقیاس لگاریتمی",
        "نمودار لگاریتمی",
        "الیوت هارمونیک",
        "تاچ",
        "امواج الیوت",
        "کیجونسن",
        "بولینگر",
        "الیوت هارمونیک",
        "تریگر",
        "تنکانسن",
        "مووینگ",
        "اهداف",
        "هارمونیک گارتلی",
        "هارمونیک پروانه",
        "شانه",
        "لاین",
        "حدضرر",
    ]

    return analyse 

def get_characters():
    characters = [
        "بازیگر",
        "حقیقی",
        "حقوقی",
        "بازی‌گردان",
        "نوسان‌گیر",
        ]

    return characters